<a href="https://colab.research.google.com/github/brendanpshea/database_sql/blob/main/SQL_04_Views%2C_Procedures%2C_Triggers%2C_Indexes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Intro to SQL 4: Views, Procedures, Triggers, Indexes
##Database and SQL | Course Notes / Brendan Shea, PhD (Brendan.Shea@rctc.edu)

To begin with, we'll need to download our Movie database, load PostgreSQL, and connect to the database.

These lecture notes are adapted, in part, from the documentation for Postgres 10. You can find the details about this here. Postgres 10 documentation lives here:
https://www.postgresql.org/docs/10/index.html

In [1]:
# Some UNIX and Pyhton utilites we need to install for the lab.
!pip install wget --quiet
!pip install sqlalchemy --quiet
!pip install ipython-sql --quiet
!pip install pgspecial --quiet

# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start

# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

# Setup a postgres database with name `my_data` to be used
!sudo -u postgres psql -U postgres -c 'DROP DATABASE IF EXISTS my_data;'
!sudo -u postgres psql -U postgres -c 'CREATE DATABASE my_data;'

# Postgres variables
%env DB_NAME=my_data
%env DB_HOST=localhost
%env DB_PORT=5432
%env DB_USER=postgres
%env DB_PASS=postgres

# Now let's download the file we'll be using for this lab
!wget -N 'https://raw.githubusercontent.com/brendanpshea/database_sql/main/movies.sql' -q

# Load our file and connect to the database
!PGPASSWORD=$DB_PASS psql -q -h $DB_HOST -p $DB_PORT -U $DB_USER -d $DB_NAME -f movies.sql

# Finally, let's make a connnection with the databse
%load_ext sql
%sql postgresql://$DB_USER:$DB_PASS@$DB_HOST/$DB_NAME

 * Starting PostgreSQL 10 database server
   ...done.
ALTER ROLE
DROP DATABASE
CREATE DATABASE
env: DB_NAME=my_data
env: DB_HOST=localhost
env: DB_PORT=5432
env: DB_USER=postgres
env: DB_PASS=postgres

'Connected: postgres@my_data'

In [2]:
# Show the first 5 rows of each table
movie_df = %sql SELECT * FROM Movie LIMIT 5;
person_df = %sql SELECT * FROM Person LIMIT 5;
actor_df = %sql SELECT * FROM Actor LIMIT 5;
director_df = %sql SELECT * FROM Director LIMIT 5;
oscar_df = %sql SELECT * FROM Oscar LIMIT 5;
print('\nMovie\n', movie_df,'\nPerson\n',person_df, '\nActor\n', actor_df, 
      '\nDirector\n', director_df, '\nOscar\n', oscar_df)

 * postgresql://postgres:***@localhost/my_data
5 rows affected.
 * postgresql://postgres:***@localhost/my_data
5 rows affected.
 * postgresql://postgres:***@localhost/my_data
5 rows affected.
 * postgresql://postgres:***@localhost/my_data
5 rows affected.
 * postgresql://postgres:***@localhost/my_data
5 rows affected.

Movie
 +---------+------------------------------+------+--------+---------+-------+---------------+
|    id   |             name             | year | rating | runtime | genre | earnings_rank |
+---------+------------------------------+------+--------+---------+-------+---------------+
| 2488496 | Star Wars: The Force Awakens | 2015 | PG-13  |   138   |   A   |       1       |
| 4154796 |      Avengers: Endgame       | 2019 | PG-13  |   181   |  AVS  |       2       |
| 0499549 |            Avatar            | 2009 | PG-13  |   162   |  AVYS |       3       |
| 1825683 |        Black Panther         | 2018 | PG-13  |   134   |  AVS  |       4       |
| 4154756 |    Avengers: Infinity War    | 2018 | PG-13  |   149   |  AVYS |       5       |
+---------+------------------------------+------+--------+---------+-------+---------------+
Person
 +---------+----------------+---------------------+------------+
|    id   |      name      |         pob         |    dob     |
+---------+----------------+---------------------+------------+
| 0001105 | Linda Darnell  |  Dallas, Texas, USA | 1923-10-16 |
| 0005253 | Elisabeth Moss |         None        | 1983-01-01 |
| 0154530 | Andrew Chavez  |         None        |    None    |
| 0240381 |  Hilary Duff   | Houston, Texas, USA | 1987-09-28 |
| 0679406 | Chuck Pfeiffer |         None        |    None    |
+---------+----------------+---------------------+------------+
Actor
 +----------+----------+
| actor_id | movie_id |
+----------+----------+
| 0000138  | 0120338  |
| 0000701  | 0120338  |
| 0000708  | 0120338  |
| 0000870  | 0120338  |
| 0000200  | 0120338  |
+----------+----------+
Director
 +-------------+----------+
| director_id | movie_id |
+-------------+----------+
|   0000116   | 0120338  |
|   0000184   | 0076759  |
|   0011470   | 0298148  |
|   0000229   | 0083866  |
|   0000184   | 0120915  |
+-------------+----------+
Oscar
 +----------+-----------+-------------------------+------+
| movie_id | person_id |           type          | year |
+----------+-----------+-------------------------+------+
| 6751668  |    None   |       BEST-PICTURE      | 2020 |
| 7286456  |  0001618  |        BEST-ACTOR       | 2020 |
| 7549996  |  0000250  |       BEST-ACTRESS      | 2020 |
| 7131622  |  0000093  |  BEST-SUPPORTING-ACTOR  | 2020 |
| 7653254  |  0000368  | BEST-SUPPORTING-ACTRESS | 2020 |
+----------+-----------+-------------------------+------+

#INSERTing and CREATEing using SELECT;
Manually inserting new data can be tedious, especially in cases where this data exists (in a different form) in another table. For this reason SQL provides a different way of doing it, which takes the following form:



```
INSERT INTO table_name(columns) SELECT <put your subquery here>

-- or, to create new table

CREATE TABLE table_name AS SELECT  <put your subquery here>
```
We'll see an example of how this works. We'll
1. Design a query for getting a list of "young directors."
2. Create a table to hold this data.
3. Insert the data into the new table using INSERT...SELECT

In [3]:
%%sql
-- First, let's get the names and dates of birth of directors born after 1980
SELECT name, dob 
FROM Person JOIN Director ON Person.id = Director.director_id
WHERE dob > '1980/1/1';

 * postgresql://postgres:***@localhost/my_data
6 rows affected.

[('Richard Glatzer', datetime.date(2015, 3, 10)),
 ('Damien Chazelle', datetime.date(1985, 1, 19)),
 ('Jon Watts', datetime.date(1981, 6, 28)),
 ('Damien Chazelle', datetime.date(1985, 1, 19)),
 ('Ryan Coogler', datetime.date(1986, 5, 23)),
 ('Jon Watts', datetime.date(1981, 6, 28))]

In [4]:
%%sql
--Now let's create a table to hold this data
CREATE TABLE YoungDirector(
  name VARCHAR (32),
  date_of_birth DATE
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [5]:
%%sql
-- Finally, let's insert the data and see the result
INSERT INTO YoungDirector(name, date_of_birth)
SELECT name, dob 
FROM Person JOIN Director ON Person.id = Director.director_id
WHERE dob > '1980/1/1';

SELECT * FROM YoungDirector;

 * postgresql://postgres:***@localhost/my_data
6 rows affected.
6 rows affected.

[('Richard Glatzer', datetime.date(2015, 3, 10)),
 ('Damien Chazelle', datetime.date(1985, 1, 19)),
 ('Jon Watts', datetime.date(1981, 6, 28)),
 ('Damien Chazelle', datetime.date(1985, 1, 19)),
 ('Ryan Coogler', datetime.date(1986, 5, 23)),
 ('Jon Watts', datetime.date(1981, 6, 28))]

In [6]:
%%sql
--A bad query
INSERT INTO YoungDirector(name, date_of_birth)
SELECT * FROM Actor;

SELECT * FROM YoungDirector;

 * postgresql://postgres:***@localhost/my_data
(psycopg2.errors.DatatypeMismatch) column "date_of_birth" is of type date but expression is of type character
LINE 3: SELECT * FROM Actor;
               ^
HINT:  You will need to rewrite or cast the expression.

[SQL: --A bad query
INSERT INTO YoungDirector(name, date_of_birth)
SELECT * FROM Actor;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [7]:
%%sql 
--A different way of doing this is:
DROP TABLE IF EXISTS YoungDirector;

CREATE TABLE YoungDirector AS 
SELECT name, dob 
FROM Person JOIN Director ON Person.id = Director.director_id
WHERE dob > '1980/1/1';

SELECT * FROM YoungDirector;

 * postgresql://postgres:***@localhost/my_data
Done.
6 rows affected.
6 rows affected.

[('Richard Glatzer', datetime.date(2015, 3, 10)),
 ('Damien Chazelle', datetime.date(1985, 1, 19)),
 ('Jon Watts', datetime.date(1981, 6, 28)),
 ('Damien Chazelle', datetime.date(1985, 1, 19)),
 ('Ryan Coogler', datetime.date(1986, 5, 23)),
 ('Jon Watts', datetime.date(1981, 6, 28))]

In [8]:
%%sql
--Reminder: How to insert data manually
INSERT INTO YoungDirector(name, dob) VALUES('Shrek', '1983-02-15');

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[]

#Transactions and COMMITS
Transactions are a fundamental concept of all database systems. The essential point of a transaction is that it bundles multiple steps into a single, all-or-nothing operation. The intermediate states between the steps are not visible to other concurrent transactions, and if some failure occurs that prevents the transaction from completing, then none of the steps affect the database at all.

For example, consider a bank database that contains balances for various customer accounts, as well as total deposit balances for branches. Suppose that we want to record a payment of $100.00 from Alice's account to Bob's account. Simplifying outrageously, the SQL commands for this might look like:


```
UPDATE accounts SET balance = balance - 100.00
    WHERE name = 'Alice';
UPDATE branches SET balance = balance - 100.00
    WHERE name = (SELECT branch_name FROM accounts WHERE name = 'Alice');
UPDATE accounts SET balance = balance + 100.00
    WHERE name = 'Bob';
UPDATE branches SET balance = balance + 100.00
    WHERE name = (SELECT branch_name FROM accounts WHERE name = 'Bob');
```

The details of these commands are not important here; the important point is that there are several separate updates involved to accomplish this rather simple operation. Our bank's officers will want to be assured that either all these updates happen, or none of them happen. It would certainly not do for a system failure to result in Bob receiving $100.00 that was not debited from Alice. Nor would Alice long remain a happy customer if she was debited without Bob being credited. We need a guarantee that if something goes wrong partway through the operation, none of the steps executed so far will take effect. Grouping the updates into a transaction gives us this guarantee. A transaction is said to be atomic: from the point of view of other transactions, it either happens completely or not at all.

In PostgreSQL, a transaction is set up by surrounding the SQL commands of the transaction with BEGIN and COMMIT commands. So our banking transaction would actually look like:


```
BEGIN;
UPDATE accounts SET balance = balance - 100.00
    WHERE name = 'Alice';
-- etc etc
COMMIT; -- or ROLLBACK if we want to cancel it.
```

When using SQL via Python notebooks (as we are doing here), commits are handled in somewhat different manner, which we won't be covering here.

#Views and Virtual Tables
A SQL **view** is simply a way of taking the result of SQL Query as saving it as it's own virtual "table." This can be really useful, if for example:
1. Different views of data are needed for different users (this is usually the case!),
2. Views can provide security (by hiding data that users don't *need* to see), and can preserve "historic" views of data (for example, when the structure of an underlying table changes, but certain users/applications still depend on the old v
3. By defaults, views are "re-made" every time you view them. However, if you have a view that is "expensive" to produce, you can make it a "material" view, and tell the database to update it only periodically.
4. Material Views (unlike normal views!) can be indexed, which can signficantly speed up data access. However, the data you see may be updated!
5. By default, views (unlike real tables) do NOT support operations such as INSERT, UPDATE, or DELETE. However, it is possible to design **updatable views** that allow this (we won't cover this here).

The format is



```
CREATE (MATERIALIZED) VIEW view_name AS
SELECT column1, column2, ...
FROM table_name
WHERE condition;
```

In [9]:
%%sql
-- So, for example, let's create a list of actors, the number of films they have been in, 
-- and the top film (in terms of earnings, they've ever been in).
-- This is computationally expensive, so we'll create a materialized view.

DROP VIEW IF EXISTS Actor_Info;
CREATE MATERIALIZED VIEW Actor_Info AS 
  SELECT Person.name as "person_name", 
    count(movie_id) as "total_movies",
      (SELECT Movie.name FROM Movie WHERE Movie.earnings_rank = 
        (SELECT MIN(Movie.earnings_rank) FROM Movie JOIN Actor ON Movie.id = Actor.movie_id
        WHERE Movie.earnings_rank IS NOT NULL
        AND Actor.actor_id = A.actor_id) 
      ) as "top_earning_movie"
  FROM Actor A JOIN Movie on A.movie_id = Movie.id
  JOIN Person ON Person.id = A.actor_id
  GROUP BY Person.name, actor_id
  ORDER BY total_movies DESC;

 * postgresql://postgres:***@localhost/my_data
Done.
2199 rows affected.

[]

In [10]:
%%sql
-- We can now reference the above view
SELECT * FROM Actor_Info LIMIT 5;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Tom Cruise', 15, 'War of the Worlds'),
 ('Tom Hanks', 12, 'Toy Story 4'),
 ('Will Smith', 12, 'Aladdin'),
 ('Robert Downey Jr.', 11, 'Avengers: Endgame'),
 ('Harrison Ford', 11, 'Star Wars: The Force Awakens')]

#PL/SQL Functions
SQL is a **declarative** language rather than a **procedural** language. That is, in SQL (unlike Java, C, Python, etc.) you tell the computer "what question you would like answered" rather than "what procedure you would like the computer to follow". This works well for most operations involving relational databases. However, there are times when the power of a procedural language (with it's IF-THEN statemets, LOOPS, and so on) can be helpful. THis is where **Procedural Langauge for SQL (PL/SQL)** comes in. A few notes:
1. PL/SQL is similar in structure to languages such as Python, Java, or C, but also has the ability to interact "natively" with data tables.
2. PL/SQL varies quite a bit by vendor (Oracle, Microsoft, IBM, Postgres), and it isn't very *portable* (so, you can't assume code you write for one vendor will work for another).
3. It's often used to "automate" certain database functions (e.g., to update data tables at regular intervals, or when some even happens), or to "save trips" to the database server (e.g., to allow us to write *one* query, tell the database server what to *do* with that query, and give us the results).
4. PL/SQL should be used only when needed. In many cases, a standard language (whether this be SQL or Python) is a better choice, given their portability.

We'll give a few examples of Postgres PL/SQL here.

In [11]:
%%sql
-- A function to generate a string "Hello, {name}, it's nice to meet you"
-- When passed a string representing a name
CREATE OR REPLACE FUNCTION hello_people(name varchar) RETURNS varchar(64) AS $$
BEGIN
    RETURN 'Hello, ' || name || ', it is nice to meet you!';
END;
$$ LANGUAGE plpgsql;

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [12]:
%%sql
-- Here's how we call the function
SELECT hello_people(name) FROM Person LIMIT 5;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Hello, Linda Darnell, it is nice to meet you!',),
 ('Hello, Elisabeth Moss, it is nice to meet you!',),
 ('Hello, Andrew Chavez, it is nice to meet you!',),
 ('Hello, Hilary Duff, it is nice to meet you!',),
 ('Hello, Chuck Pfeiffer, it is nice to meet you!',)]

In [13]:
%%sql 
CREATE OR REPLACE FUNCTION print_runtime (minutes integer) RETURNS varchar AS $$
DECLARE
  hours integer := minutes / 60;
  extra_minutes integer := minutes % 60;

BEGIN
  RETURN hours || ' hours and ' || extra_minutes || ' minutes';
END;
$$ LANGUAGE plpgsql

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [14]:
%%sql
SELECT name, print_runtime(runtime) FROM Movie LIMIT 10;

 * postgresql://postgres:***@localhost/my_data
10 rows affected.

[('Star Wars: The Force Awakens', '2 hours and 18 minutes'),
 ('Avengers: Endgame', '3 hours and 1 minutes'),
 ('Avatar', '2 hours and 42 minutes'),
 ('Black Panther', '2 hours and 14 minutes'),
 ('Avengers: Infinity War', '2 hours and 29 minutes'),
 ('Titanic', '3 hours and 14 minutes'),
 ('Jurassic World', '2 hours and 4 minutes'),
 ('The Avengers', '2 hours and 23 minutes'),
 ('Star Wars: Episode VIII - The Last Jedi', '2 hours and 32 minutes'),
 ('Incredibles 2', '1 hours and 58 minutes')]

#Triggers
A TRIGGER is a special function that can be set to "listen" for a certain event, and then DO something in response. Such events might be:
1. When a certain date/time is reached.
2. When rows on a specified table are updated/inserted/deleted.
3. A combination of different factors (for example, a certain date is reached, and a new row is inserted that meets some specified criteria).

Sample uses:
1. A trigger function might be set up to UPDATE database tables at night (for example, taking new data that have been gathered over the course of the day) and inserting into the table.
2. Checking to make sure that the internal state of the database remanins consistent (for example, checking and updating the status of customer's account before they are allowed to make a transaction).
3. Making changes to *many* tables when an event of a certain type occurs (for example, a customer death might trigger many changes in many tables).

Format:


```
CREATE TRIGGER [trigger_name] 
[BEFORE | AFTER]  
{INSERT | UPDATE | DELETE}  
ON [table_name]  -- must be linked to specific table
[FOR each row]  -- default is ONLY rows that tripped trigger
[trigger_body] 

```
As an example, we'll create a trigger to "listen" for a Person's death in our movie database.

In [15]:
%%sql
-- First, let's add a "date of death" column to Person
ALTER TABLE Person ADD COLUMN dod DATE;

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [16]:
%%sql
-- And, let's add a table to list "Deceased actors"
CREATE TABLE DeadActors (
  death_notice VARCHAR(64)
);
SELECT * FROM DeadActors;

 * postgresql://postgres:***@localhost/my_data
Done.
0 rows affected.

[]

In [17]:
%%sql
-- Now let's see what the Person table looks like
SELECT * FROM Person ORDER BY dob ASC LIMIT 5;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('0334581', 'Albert Gran', 'Bergen, Norway', datetime.date(1862, 8, 4), None),
 ('0807580', 'C. Aubrey Smith', 'London, England, UK', datetime.date(1863, 7, 21), None),
 ('0804375', 'Alison Skipworth', 'London, England, UK', datetime.date(1863, 7, 25), None),
 ('0926599', 'Dame May Whitty', 'Liverpool, England, UK', datetime.date(1865, 6, 19), None),
 ('0237597', 'Marie Dressler', 'Cobourg, Ontario, Canada', datetime.date(1868, 11, 9), None)]

In [18]:
%%sql 
--let's create a trigger function to add
-- (DECEASED) to their name when they die

CREATE OR REPLACE FUNCTION now_dead()
  RETURNS trigger AS
$$
BEGIN
    INSERT INTO DeadActors(death_notice) VALUES (NEW.name || ' has passed away on ' || NEW.dod);
    RETURN NEW;
END;
$$
LANGUAGE 'plpgsql';


DROP TRIGGER IF EXISTS death_listen ON Person;
CREATE TRIGGER death_listen
BEFORE UPDATE
ON Person
FOR EACH ROW
WHEN (NEW.dod IS NOT NULL)
EXECUTE PROCEDURE now_dead();

 * postgresql://postgres:***@localhost/my_data
Done.
Done.
Done.

[]

In [19]:
%%sql
-- Now's let see what happens when we update some dates of death!
UPDATE Person SET dod = '1932/12/16' WHERE name = 'Albert Gran';
UPDATE Person SET dod = '1948/12/20' WHERE name = 'C. Aubrey Smith';

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.

[]

In [20]:
%%sql
SELECT * FROM DeadActors;

 * postgresql://postgres:***@localhost/my_data
2 rows affected.

[('Albert Gran has passed away on 1932-12-16',),
 ('C. Aubrey Smith has passed away on 1948-12-20',)]

#Indexing and Query Perfomance
Creating a database INDEX on a certain column tells the database to store information about the column in a manner that will make it easier to retrieve information about the column in the future. So, future "SELECTS" on indexed columns will be faster. However, future INSERTS or UPDATES will be slower (since the DBMS will need to update the index periodically).



```
CREATE INDEX index_name ON table_name(column_name);

```



Let's see how indexes can help us increase performance. We'll be using EXPLAIN and ANALYZE to show how the performance of our queries. We'll be searching for "Keanu Reeves" using a number of different strategies.

In [21]:
%%sql
-- First let's insert some junk rows into our database, so it big enough to demonstrate search differences

INSERT INTO Person(id,name) SELECT generate_series(9000000,9010000), 'New Person ' || generate_series(9000000,9010000)

 * postgresql://postgres:***@localhost/my_data
10001 rows affected.

[]

In [22]:
%%sql
-- What our random data looks like
SELECT * FROM Person WHERE id :: integer > 9000000 LIMIT 5;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('9000115', 'New Person 9000115', None, None, None),
 ('9000116', 'New Person 9000116', None, None, None),
 ('9000117', 'New Person 9000117', None, None, None),
 ('9000118', 'New Person 9000118', None, None, None),
 ('9000119', 'New Person 9000119', None, None, None)]

In [23]:
%%sql
-- Now, let's search for Keanu.
-- First, let's search for his First and last name separately
-- Sequential scan is bad!
EXPLAIN ANALYZE SELECT * FROM Person WHERE name LIKE '%Keanu%' and name LIKE '%Reeves%';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on person  (cost=0.00..152.52 rows=1 width=460) (actual time=0.359..3.276 rows=1 loops=1)',),
 ("  Filter: (((name)::text ~~ '%Keanu%'::text) AND ((name)::text ~~ '%Reeves%'::text))",),
 ('  Rows Removed by Filter: 12627',),
 ('Planning time: 0.069 ms',),
 ('Execution time: 3.298 ms',)]

In [24]:
%%sql
-- Now, let's search for his name *at the beginning* of the string
EXPLAIN ANALYZE SELECT * FROM Person WHERE name LIKE '%Keanu Reeves';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on person  (cost=0.00..147.60 rows=1 width=460) (actual time=0.363..3.183 rows=1 loops=1)',),
 ("  Filter: ((name)::text ~~ '%Keanu Reeves'::text)",),
 ('  Rows Removed by Filter: 12627',),
 ('Planning time: 0.066 ms',),
 ('Execution time: 3.203 ms',)]

In [25]:
%%sql
-- Now, let's try for equality. It's faster!
EXPLAIN ANALYZE SELECT * FROM Person WHERE name = 'Keanu Reeves';

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[('Seq Scan on person  (cost=0.00..147.60 rows=10 width=460) (actual time=0.254..2.019 rows=1 loops=1)',),
 ("  Filter: ((name)::text = 'Keanu Reeves'::text)",),
 ('  Rows Removed by Filter: 12627',),
 ('Planning time: 0.085 ms',),
 ('Execution time: 2.042 ms',)]

In [26]:
%%sql
-- Finally, let's create an index and try again
-- "Index scan" is what we want to see
CREATE INDEX name_dex ON Person(name);
EXPLAIN ANALYZE SELECT * FROM Person WHERE name = 'Keanu Reeves';

 * postgresql://postgres:***@localhost/my_data
Done.
7 rows affected.

[('Bitmap Heap Scan on person  (cost=4.77..111.04 rows=63 width=460) (actual time=0.041..0.042 rows=1 loops=1)',),
 ("  Recheck Cond: ((name)::text = 'Keanu Reeves'::text)",),
 ('  Heap Blocks: exact=1',),
 ('  ->  Bitmap Index Scan on name_dex  (cost=0.00..4.76 rows=63 width=0) (actual time=0.035..0.035 rows=1 loops=1)',),
 ("        Index Cond: ((name)::text = 'Keanu Reeves'::text)",),
 ('Planning time: 0.216 ms',),
 ('Execution time: 0.067 ms',)]

Our final query is an order of magnitude faster than our initial effort. Creating and using indexes effectively is among the most important things (along with writing efficient SQL code!) to ensure good database performance.